Управление_по_целям_и_KPI/src/Catalogs/KPI_ГрафикиРабот/KPI_ГрафикиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_ГрафикиРабот</name>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>Number</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочихЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаГрафика</name>
    <type>
      <types>CatalogRef.KPI_ФормулыГрафиков</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеГрафика</name>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов7</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов8</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов9</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов11</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов12</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов13</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов14</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов15</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов16</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов17</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов19</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов20</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов21</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов22</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов23</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов24</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов25</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов26</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов27</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов28</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов29</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов30</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов31</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня1</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня2</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня3</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня4</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня5</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня6</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня7</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня8</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня9</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня10</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня11</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня12</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня13</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня14</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня15</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня16</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня17</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня18</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня19</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня20</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня21</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня22</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня23</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня24</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня25</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня26</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня27</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня28</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня29</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня30</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня31</name>
      <type>
        <types>EnumRef.KPI_ВидыДнейГрафика</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_ГрафикиРабот/KPI_ГрафикиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_ГрафикиРабот</name>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.KPI_ВидыДнейГрафика</types>
    </type>
  </resources>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.KPI_ГрафикиРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/Enums/KPI_ВидыДнейГрафика/KPI_ВидыДнейГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>KPI_ВидыДнейГрафика</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Праздник</name>
  </enumValues>
  <enumValues>
    <name>Предпраздничный</name>
  </enumValues>
  <enumValues>
    <name>Выходной</name>
  </enumValues>
</mdclass:Enum>

Управление_по_целям_и_KPI/src/Catalogs/KPI_ГрафикиРабот/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
		
	ГрафикРаботы                                  = РегистрыСведений.KPI_ГрафикиРабот.СоздатьНаборЗаписей();
	ГрафикРаботы.Отбор.ГрафикРаботы.Значение      = Ссылка;
	ГрафикРаботы.Отбор.ГрафикРаботы.Использование = Истина;
	ГрафикРаботы.Очистить();
	ГрафикРаботы.Записать();
	ГрафикРаботы.Записывать                       = Истина;

	
	Для Каждого ГрафикМесяца из ДанныеГрафика Цикл
		Дата                 = НачалоМесяца(ГрафикМесяца.Месяц);
		КоличествоДнейМесяца = KPI_ИнтерфейсКлиентСервер.КоличествоДнейМесяца(Дата);
		Для НомерДня = 1 по КоличествоДнейМесяца Цикл
			ДеньГрафика              = ГрафикРаботы.Добавить();
			ДеньГрафика.ГрафикРаботы = Ссылка;
			ДеньГрафика.Дата         = Дата;
			ДеньГрафика.ВидДня       = ГрафикМесяца["ВидДня" + НомерДня];
			КоличествоРабочихЧасов   = ГрафикМесяца["Часов"  + НомерДня];
			ДеньГрафика.Часы         = КоличествоРабочихЧасов;
			Дата                     = Дата + 86400; //60*60*24
		КонецЦикла;
		 
	КонецЦикла;
	
	ГрафикРаботы.Записать();
	
КонецПроцедуры

//Процедура заполняет данные графика
//Параметры:
// НачалоПериода  - тип дата, укзавает дату с которой начинается заполнение
Процедура ЗаполнитьДанныеГрафика(НачалоПериодаЗаполнения = Неопределено) Экспорт
	
	Если KPI_ПереопределяемыйСервер.ИнтегрированныйФункционал() Тогда
		KPI_ПереопределяемыйСервер.ЗаполнитьГрафикПоДаннымПроизводственногоКалендаря(ЭтотОбъект)
	Иначе 
		ЗаполнитьДанныеГрафикаСменный(НачалоПериодаЗаполнения);				
	КонецЕсли;
	
	//посчитаем суммы часов и дней
	Для м = 1 По 12 Цикл
		СтрГрафика = ДанныеГрафика.Получить(м - 1);
		
		сумм = 0;
		колво = 0;
		
		Для д = 1 По 31 Цикл
			ТекЧасов = СтрГрафика["Часов" + д];
			
			сумм = сумм + ТекЧасов;
			
			Если ТекЧасов > 0 Тогда
				колво = колво + 1;
			КонецЕсли;
		КонецЦикла;
		
		СтрГрафика.ИтогоЧасов = сумм;
		СтрГрафика.ИтогоДней = колво;
	КонецЦикла;

	Записать();
	
КонецПроцедуры

Процедура ЗаполнитьДанныеГрафикаСменный(НачалоПериодаЗаполнения)
	
	НачальнаяДата           = Дата(Формат(Год,"ЧГ=")+"0101");
	НачальнаяДата           = НачалоПериодаЗаполнения;
	КонечнаяДата            = Дата(Формат(Год,"ЧГ=")+"1231");
	КоличествоРабочихДней   = ФормулаГрафика.ЧислоРабочихДней;
	КоличествоВыходныхДней  = ФормулаГрафика.ЧислоВыходныхДней;
	
	ДанныеГрафика.Очистить();
	
	НачалоМесяца = НачалоМесяца(НачальнаяДата);
	Для НомерМесяца = 0 по 11 Цикл
		нСтр              = ДанныеГрафика.Добавить();
		НСтр.Месяц        = ДобавитьМесяц(НачалоМесяца,НомерМесяца);
	КонецЦикла;
	
	Пока НачальнаяДата < КонечнаяДата Цикл
		
		Если НачальнаяДата < КонечнаяДата Тогда
        	ЗаполнитьРабочиеДни(НачальнаяДата,КоличествоРабочихДней);
		КонецЕсли;
	
		Если НачальнаяДата < КонечнаяДата Тогда
			ЗаполнитьВыходныеДни(НачальнаяДата,КоличествоВыходныхДней);
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ФормулаГрафика.СкользящийГрафик Тогда
		ПраздничныеДни          = Справочники.KPI_ГрафикиРабот.ПраздничныеДни(Год);
		Праздник                = Перечисления.KPI_ВидыДнейГрафика.Праздник;
		Предпраздничный         = Перечисления.KPI_ВидыДнейГрафика.Предпраздничный;
        
		Пока ПраздничныеДни.Следующий() Цикл
			
			ИндексМесяца  = Месяц(ПраздничныеДни.Дата) - 1;
			НомерДня      = Строка(День(ПраздничныеДни.Дата));
			СтрокаГрафика = ДанныеГрафика.Получить(ИндексМесяца);
			СтрокаГрафика["ВидДня" + НомерДня] =  ПраздничныеДни.ВидДня;
			Если  ПраздничныеДни.ВидДня = Праздник Тогда
				СтрокаГрафика["Часов"  + НомерДня] = 0;
			ИначеЕсли ПраздничныеДни.ВидДня = Предпраздничный Тогда
				СтрокаГрафика["Часов"  + НомерДня] = РабочихЧасов - 1;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеГрафика.Сортировать("Месяц");
	
КонецПроцедуры

Функция ЗаполнитьВыходныеДни(ДатаМесяца,Знач ЧислоВыходныхДней)
		
	КонецМесяца   = КонецМесяца(ДатаМесяца);
	ИндексМесяца  = Месяц(ДатаМесяца) - 1;
	СтрокаГрафика = ДанныеГрафика.Получить(ИндексМесяца);
	ВыходнойДень  = Перечисления.KPI_ВидыДнейГрафика.Выходной;
	Пока НЕ ЧислоВыходныхДней = 0 И НЕ КонецМесяца < ДатаМесяца Цикл
		
		НомерДня = Строка(День(ДатаМесяца));
		СтрокаГрафика["Часов"  + НомерДня] = 0;
		СтрокаГрафика["ВидДня" + НомерДня]                 = ВыходнойДень;
		ДатаМесяца = ДатаМесяца + 86400;

		ЧислоВыходныхДней = ЧислоВыходныхДней - 1;
		
	КонецЦикла;
	

	
	Если ЧислоВыходныхДней Тогда
		Если ДатаМесяца = КонецГода(КонецМесяца)+1  Тогда
		 ЗаполнитьВыходныеДни(ДатаМесяца,ЧислоВыходныхДней);
		 КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьРабочиеДни(ДатаМесяца,Знач ЧислоРабочихДней)
	
	КонецМесяца   = КонецМесяца(ДатаМесяца);
	ИндексМесяца  = Месяц(ДатаМесяца) - 1;
	СтрокаГрафика = ДанныеГрафика.Получить(ИндексМесяца);
	РабочийДень   = Перечисления.KPI_ВидыДнейГрафика.Рабочий;
	Пока НЕ ЧислоРабочихДней = 0 И НЕ КонецМесяца < ДатаМесяца Цикл
		
		НомерДня = Строка(День(ДатаМесяца));
		СтрокаГрафика["Часов"  + Строка(День(ДатаМесяца))] = РабочихЧасов;
		СтрокаГрафика["ВидДня" + НомерДня]                 = РабочийДень;
		
		ДатаМесяца = ДатаМесяца + 86400;

		ЧислоРабочихДней = ЧислоРабочихДней - 1;
		
	КонецЦикла;
		
	Если ЧислоРабочихДней Тогда
		Если НЕ ДатаМесяца = КонецГода(КонецМесяца)+1 Тогда
			ЗаполнитьРабочиеДни(ДатаМесяца,ЧислоРабочихДней);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Год = Год(ТекущаяДата())
	
КонецПроцедуры
